# IN THIS PROJECT I HAVE INVESTIGATED THE DATA FROM CIA WORLD FACTBOOK. THE factbook.db DATABASE HAS BEEN LOADED.

In [19]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

'Connected: None@factbook.db'

In [20]:
%%sql
SELECT * FROM sqlite_master WHERE type='table';

Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [21]:
%%sql
SELECT * FROM facts LIMIT 5;

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

In [22]:
%%sql
SELECT MIN(population),MAX(population),MIN(population_growth),
MAX(population_growth) FROM facts;

Done.

[(48, 1367485388, 0.0, 4.02)]

In [5]:
%%sql
SELECT name FROM facts WHERE population=(SELECT MIN(population)
                                        FROM facts);

Done.

[('Pitcairn Islands',)]

THUS PITCAIM ISLANDS IS THE COUNTRY WITH MINIMUM POPULATION IN THE WORLD, WITH A PUNY POPULATION OF 48.

In [23]:
%%sql
DELETE FROM facts WHERE name='World';
SELECT name FROM facts WHERE population=
(SELECT MAX(population) from facts);

0 rows affected.
Done.

[('China',)]

CHINA IS THE COUNTRY WITH THE HIGHEST POPULATION IN THE WORLD.

In [24]:
%%sql
DELETE FROM facts WHERE name='Antarctica';

0 rows affected.

[]

In [25]:
%%sql
SELECT MAX(population),MIN(population),MAX(population_growth),
MIN(population_growth) FROM facts;

Done.

[(1367485388, 48, 4.02, 0.0)]

In [26]:
%%sql
SELECT AVG(population),AVG(area) FROM facts;

Done.

[(32377011.0125, 555093.546184739)]

THE COUNTRIES WITH POPULATION HIGHER THAN AVERAGE BUT AREA LOWER THAN AVERAGE.

In [27]:
%%sql
SELECT name FROM facts 
WHERE population>(SELECT AVG(population) FROM facts)
AND area<(SELECT AVG(area) FROM facts);

Done.

[('Bangladesh',),
 ('Germany',),
 ('Iraq',),
 ('Italy',),
 ('Japan',),
 ('Korea, South',),
 ('Morocco',),
 ('Philippines',),
 ('Poland',),
 ('Spain',),
 ('Thailand',),
 ('Uganda',),
 ('United Kingdom',),
 ('Vietnam',)]

In [14]:
%%sql
SELECT name FROM facts WHERE population_growth
=(SELECT MAX(population_growth)
FROM facts);

Done.

[('South Sudan',)]

THE COUNTRY WITH HIGHEST POPULATION GROWTH IS SOUTH SUDAN.

In [28]:
%%sql
SELECT name FROM facts WHERE area_water/area_land=
(SELECT MAX(area_water/area_land) FROM facts);

Done.

[('British Indian Ocean Territory',)]

BRITISH INDIAN OCEAN TERRITORY HAS THE HIGHEST RATIO OF WATER AREA TO LAND AREA.

THE COUNTRIES WITH HIGHER DEATH RATE THAN BIRTH RATE:

In [29]:
%%sql
SELECT name FROM facts WHERE death_rate>birth_rate;

Done.

[('Austria',),
 ('Belarus',),
 ('Bosnia and Herzegovina',),
 ('Bulgaria',),
 ('Croatia',),
 ('Czech Republic',),
 ('Estonia',),
 ('Germany',),
 ('Greece',),
 ('Hungary',),
 ('Italy',),
 ('Japan',),
 ('Latvia',),
 ('Lithuania',),
 ('Moldova',),
 ('Monaco',),
 ('Poland',),
 ('Portugal',),
 ('Romania',),
 ('Russia',),
 ('Serbia',),
 ('Slovenia',),
 ('Ukraine',),
 ('Saint Pierre and Miquelon',)]

THE TOP 10 COUNTRIES WITH HIGHEST POPULATION DENSITY:

In [30]:
%%sql
SELECT name,population/area AS population_density FROM facts 
ORDER BY population_density DESC LIMIT 10;

Done.

[('Macau', 21168),
 ('Monaco', 15267),
 ('Singapore', 8141),
 ('Hong Kong', 6445),
 ('Gaza Strip', 5191),
 ('Gibraltar', 4876),
 ('Bahrain', 1771),
 ('Maldives', 1319),
 ('Malta', 1310),
 ('Bermuda', 1299)]